YCSB output txt files/test10000B/jdbc_workloadb_10000_run_240420.txt
Adding shard node URL: jdbc:mysql://localhost:3306/Benchtest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 27957
[OVERALL], Throughput(ops/sec), 357.6921701183961
[TOTAL_GCS_PS_Scavenge], Count, 3
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 37
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.13234610294380655
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 37
[TOTAL_GC_TIME_%], Time(%), 0.13234610294380655
[READ], Operations, 4319
[READ], AverageLatency(us), 456.6411206297754
[READ], MinLatency(us), 246
[READ], MaxLatency(us), 16215
[READ], 95thPercentileLatency(us), 679
[READ], 99thPercentileLatency(us), 1056
[READ], Return=OK, 4319
[READ], Return=NOT_FOUND, 5217
[UPDATE-FAILED], Operations, 245
[UPDATE-FAILED], AverageLatency(us), 613.9959183673469
[UPDATE-FAILED], MinLatency(us), 317
[UPDATE-FAILED], MaxLatency(us), 12447
[UPDATE-FAILED], 95thPercentileLatency(us), 1007
[UPDATE-FAILED], 99thPercentileLatency(us), 3661
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1841.0
[CLEANUP], MinLatency(us), 1841
[CLEANUP], MaxLatency(us), 1841
[CLEANUP], 95thPercentileLatency(us), 1841
[CLEANUP], 99thPercentileLatency(us), 1841
[READ-FAILED], Operations, 5217
[READ-FAILED], AverageLatency(us), 411.1410772474602
[READ-FAILED], MinLatency(us), 217
[READ-FAILED], MaxLatency(us), 19391
[READ-FAILED], 95thPercentileLatency(us), 596
[READ-FAILED], 99thPercentileLatency(us), 1162
[UPDATE], Operations, 219
[UPDATE], AverageLatency(us), 104214.57534246576
[UPDATE], MinLatency(us), 17744
[UPDATE], MaxLatency(us), 507135
[UPDATE], 95thPercentileLatency(us), 354559
[UPDATE], 99thPercentileLatency(us), 411647
[UPDATE], Return=OK, 219
[UPDATE], Return=UNEXPECTED_STATE, 245